{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "google/gemma-4-E2B-it",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "lora_ga_config": null,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.19.1",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "language_model.layers.16.self_attn.o_proj",
    "language_model.layers.22.self_attn.o_proj",
    "language_model.layers.32.self_attn.q_proj",
    "language_model.layers.23.self_attn.v_proj",
    "language_model.layers.24.self_attn.o_proj",
    "language_model.layers.16.self_attn.v_proj",
    "language_model.layers.16.self_attn.q_proj",
    "language_model.layers.26.self_attn.v_proj",
    "language_model.layers.2.self_attn.q_proj",
    "language_model.layers.27.self_attn.v_proj",
    "language_model.layers.26.self_attn.q_proj",
    "language_model.layers.6.self_attn.q_proj",
    "language_model.layers.28.self_attn.q_proj",
    "language_model.layers.33.self_attn.o_proj",
    "language_model.layers.9.self_attn.q_proj",
    "language_model.layers.0.self_attn.o_proj",
    "language_model.layers.21.self_attn.v_proj",
    "language_model.layers.17.self_attn.v_proj",
    "language_model.layers.7.self_attn.v_proj",
    "language_model.layers.6.self_attn.v_proj",
    "language_model.layers.32.self_attn.o_proj",
    "language_model.layers.17.self_attn.q_proj",
    "language_model.layers.7.self_attn.q_proj",
    "language_model.layers.12.self_attn.o_proj",
    "language_model.layers.12.self_attn.q_proj",
    "language_model.layers.3.self_attn.o_proj",
    "language_model.layers.27.self_attn.o_proj",
    "language_model.layers.28.self_attn.o_proj",
    "language_model.layers.14.self_attn.o_proj",
    "language_model.layers.27.self_attn.q_proj",
    "language_model.layers.30.self_attn.v_proj",
    "language_model.layers.25.self_attn.o_proj",
    "language_model.layers.29.self_attn.o_proj",
    "language_model.layers.10.self_attn.q_proj",
    "language_model.layers.2.self_attn.o_proj",
    "language_model.layers.4.self_attn.v_proj",
    "language_model.layers.8.self_attn.q_proj",
    "language_model.layers.22.self_attn.q_proj",
    "language_model.layers.34.self_attn.q_proj",
    "language_model.layers.1.self_attn.o_proj",
    "language_model.layers.30.self_attn.o_proj",
    "language_model.layers.15.self_attn.v_proj",
    "language_model.layers.30.self_attn.q_proj",
    "language_model.layers.3.self_attn.v_proj",
    "language_model.layers.31.self_attn.v_proj",
    "language_model.layers.11.self_attn.v_proj",
    "language_model.layers.3.self_attn.q_proj",
    "language_model.layers.19.self_attn.o_proj",
    "language_model.layers.9.self_attn.o_proj",
    "language_model.layers.31.self_attn.q_proj",
    "language_model.layers.14.self_attn.q_proj",
    "language_model.layers.4.self_attn.q_proj",
    "language_model.layers.17.self_attn.o_proj",
    "language_model.layers.14.self_attn.v_proj",
    "language_model.layers.5.self_attn.o_proj",
    "language_model.layers.10.self_attn.v_proj",
    "language_model.layers.13.self_attn.q_proj",
    "language_model.layers.28.self_attn.v_proj",
    "language_model.layers.1.self_attn.q_proj",
    "language_model.layers.19.self_attn.q_proj",
    "language_model.layers.10.self_attn.o_proj",
    "language_model.layers.33.self_attn.v_proj",
    "language_model.layers.7.self_attn.o_proj",
    "language_model.layers.31.self_attn.o_proj",
    "language_model.layers.1.self_attn.v_proj",
    "language_model.layers.33.self_attn.q_proj",
    "language_model.layers.20.self_attn.q_proj",
    "language_model.layers.6.self_attn.o_proj",
    "language_model.layers.29.self_attn.v_proj",
    "language_model.layers.22.self_attn.v_proj",
    "language_model.layers.12.self_attn.v_proj",
    "language_model.layers.0.self_attn.q_proj",
    "language_model.layers.0.self_attn.v_proj",
    "language_model.layers.24.self_attn.q_proj",
    "language_model.layers.20.self_attn.v_proj",
    "language_model.layers.11.self_attn.q_proj",
    "language_model.layers.5.self_attn.q_proj",
    "language_model.layers.2.self_attn.v_proj",
    "language_model.layers.18.self_attn.v_proj",
    "language_model.layers.34.self_attn.v_proj",
    "language_model.layers.23.self_attn.o_proj",
    "language_model.layers.24.self_attn.v_proj",
    "language_model.layers.15.self_attn.o_proj",
    "language_model.layers.18.self_attn.o_proj",
    "language_model.layers.5.self_attn.v_proj",
    "language_model.layers.4.self_attn.o_proj",
    "language_model.layers.19.self_attn.v_proj",
    "language_model.layers.8.self_attn.v_proj",
    "language_model.layers.21.self_attn.q_proj",
    "language_model.layers.18.self_attn.q_proj",
    "language_model.layers.20.self_attn.o_proj",
    "language_model.layers.34.self_attn.o_proj",
    "language_model.layers.25.self_attn.v_proj",
    "language_model.layers.13.self_attn.o_proj",
    "language_model.layers.11.self_attn.o_proj",
    "language_model.layers.26.self_attn.o_proj",
    "language_model.layers.8.self_attn.o_proj",
    "language_model.layers.15.self_attn.q_proj",
    "language_model.layers.32.self_attn.v_proj",
    "language_model.layers.21.self_attn.o_proj",
    "language_model.layers.23.self_attn.q_proj",
    "language_model.layers.25.self_attn.q_proj",
    "language_model.layers.29.self_attn.q_proj",
    "language_model.layers.13.self_attn.v_proj",
    "language_model.layers.9.self_attn.v_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_bdlora": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}